In [1]:
import pandas as pd

# Making a dataframe from a dictionary

In [2]:
data = {
    'name': ['robert', 'richard', 'maximus', 'olivia', 'mia', 'sydney', 'reina', 'takeshi', 'sakura'],
    'age': [33, 35, 34, 28, 22, 40, 21, 29, 25],
    'career': ['linguist', 'teacher', 'doctor', 'engineer', 'clerk', 
               'manager', 'driver', 'nurse', 'YouTuber'],
    'fav_hobby': ['reading', 'watching tv', 'fishing', 'rock climbing', 
                  'bowling', 'playing video games', 'working out', 'painting', 'chess'],
}

In [3]:
df = pd.DataFrame(data=data)

In [4]:
print(df)

      name  age    career            fav_hobby
0   robert   33  linguist              reading
1  richard   35   teacher          watching tv
2  maximus   34    doctor              fishing
3   olivia   28  engineer        rock climbing
4      mia   22     clerk              bowling
5   sydney   40   manager  playing video games
6    reina   21    driver          working out
7  takeshi   29     nurse             painting
8   sakura   25  YouTuber                chess

# Making a dataframe by reading in from a csv

In [5]:
salary_df = pd.read_csv('salary.csv', delimiter='\t')

In [6]:
print(salary_df)

      name                        career  yearly_salary gender  age age_group
0     Brad                        doctor         150000      m   35     30–39
1     Sana                 idol / singer        1450000      f   28     20–29
2     Luke                  data analyst          80000      m   39     30–39
3     Tony                       teacher          45000      m   42     40–49
4     Mike                 account clerk          44630      m   25     20–29
5     Leia             chemical engineer         112000      f   45     40–49
6     Nick                           CEO         250000      m   57     50–59
7   Cheryl   software engineering intern          68000      f   23     20–29
8    Wayne                        author          75000      m   75     70–79
9    Julie                        author          80000      f   40     40–49
10    John         pizza delivery driver          30000      m   37     30–39
11    Jean                      waitress          30000      f   27     20–29
12   Sonja                     professor         150000      f   45     40–49
13   Sarah                   Uber driver          40000      f   38     30–39
14    Mary                        lawyer         300000      f   33     30–39
15  Olivia                    day trader          80000      f   65     60–69
16   Pilar  entrepreneur / self-employed          55000      m   47     40–49

# Getting series from dataframe

In [7]:
name_series = salary_df.name

In [8]:
print(name_series)

0       Brad
1       Sana
2       Luke
3       Tony
4       Mike
5       Leia
6       Nick
7     Cheryl
8      Wayne
9      Julie
10      John
11      Jean
12     Sonja
13     Sarah
14      Mary
15    Olivia
16     Pilar
Name: name, dtype: object

In [9]:
# print(type(name_series))

In [10]:
age_series = salary_df['age']

In [11]:
print(age_series)

0     35
1     28
2     39
3     42
4     25
5     45
6     57
7     23
8     75
9     40
10    37
11    27
12    45
13    38
14    33
15    65
16    47
Name: age, dtype: int64

In [12]:
# print(type(age_series))

In [13]:
career_series = salary_df.career

In [14]:
print(career_series)

0                           doctor
1                    idol / singer
2                     data analyst
3                          teacher
4                    account clerk
5                chemical engineer
6                              CEO
7      software engineering intern
8                           author
9                           author
10           pizza delivery driver
11                        waitress
12                       professor
13                     Uber driver
14                          lawyer
15                      day trader
16    entrepreneur / self-employed
Name: career, dtype: object

In [15]:
# print(type(career_series))

In [16]:
yearly_salary_series = salary_df['yearly_salary']

In [17]:
print(yearly_salary_series)

0      150000
1     1450000
2       80000
3       45000
4       44630
5      112000
6      250000
7       68000
8       75000
9       80000
10      30000
11      30000
12     150000
13      40000
14     300000
15      80000
16      55000
Name: yearly_salary, dtype: int64

In [18]:
# print(type(yearly_salary_series))

In [19]:
gender_series = salary_df['gender']

In [20]:
print(gender_series)

0     m
1     f
2     m
3     m
4     m
5     f
6     m
7     f
8     m
9     f
10    m
11    f
12    f
13    f
14    f
15    f
16    m
Name: gender, dtype: object

In [21]:
# print(type(gender_series))

In [22]:
age_series = salary_df['age']

In [23]:
print(age_series)

0     35
1     28
2     39
3     42
4     25
5     45
6     57
7     23
8     75
9     40
10    37
11    27
12    45
13    38
14    33
15    65
16    47
Name: age, dtype: int64

In [24]:
# print(type(age_series))

In [25]:
age_group_series = salary_df['age_group']

In [26]:
print(age_group_series)

0     30–39
1     20–29
2     30–39
3     40–49
4     20–29
5     40–49
6     50–59
7     20–29
8     70–79
9     40–49
10    30–39
11    20–29
12    40–49
13    30–39
14    30–39
15    60–69
16    40–49
Name: age_group, dtype: object

In [27]:
# print(type(age_group_series))